note/drawio/converted/dot/260414-project-counter-10000.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_Gdv3_p0J4g2QtB7_2rpD_1" [label="Btn_D"];
  "n_Gdv3_p0J4g2QtB7_2rpD_2" [label="Btn_L"];
  "n_Gdv3_p0J4g2QtB7_2rpD_3" [label="Btn_R"];
  "n_Gdv3_p0J4g2QtB7_2rpD_7" [label="mode"];
  "n_Gdv3_p0J4g2QtB7_2rpD_8" [label="clear"];
  "n_Gdv3_p0J4g2QtB7_2rpD_9" [label="run_stop"];
  "n_adgLpoAnAb905ZfSkwzA_1" [label="node_kwzA-1"];
  "n_adgLpoAnAb905ZfSkwzA_10" [label="node_wzA-10"];
  "n_adgLpoAnAb905ZfSkwzA_11" [label="control_unit"];
  "n_adgLpoAnAb905ZfSkwzA_13" [label="run_en"];
  "n_adgLpoAnAb905ZfSkwzA_14" [label="clear_en"];
  "n_adgLpoAnAb905ZfSkwzA_15" [label="down_mode"];
  "n_adgLpoAnAb905ZfSkwzA_16" [label="datapath"];
  "n_adgLpoAnAb905ZfSkwzA_17" [label="tick_gen"];
  "n_adgLpoAnAb905ZfSkwzA_18" [label="clk"];
  "n_adgLpoAnAb905ZfSkwzA_19" [label="rst"];
  "n_adgLpoAnAb905ZfSkwzA_20" [label="run_en"];
  "n_adgLpoAnAb905ZfSkwzA_21" [label="tick"];
  "n_adgLpoAnAb905ZfSkwzA_22" [label="node_wzA-22"];
  "n_adgLpoAnAb905ZfSkwzA_23" [label="tick_counter"];
  "n_adgLpoAnAb905ZfSkwzA_24" [label="clk"];
  "n_adgLpoAnAb905ZfSkwzA_25" [label="rst"];
  "n_adgLpoAnAb905ZfSkwzA_26" [label="tick"];
  "n_adgLpoAnAb905ZfSkwzA_27" [label="run_en"];
  "n_adgLpoAnAb905ZfSkwzA_28" [label="clear_en"];
  "n_adgLpoAnAb905ZfSkwzA_29" [label="down_mode"];
  "n_adgLpoAnAb905ZfSkwzA_3" [label="node_kwzA-3"];
  "n_adgLpoAnAb905ZfSkwzA_33" [label="counter_10000"];
  "n_adgLpoAnAb905ZfSkwzA_34" [label="fnd_controller"];
  "n_adgLpoAnAb905ZfSkwzA_38" [label="fnd_com[3:0]"];
  "n_adgLpoAnAb905ZfSkwzA_39" [label="fnd_data[7:0]"];
  "n_adgLpoAnAb905ZfSkwzA_40" [label="datapath"];
  "n_adgLpoAnAb905ZfSkwzA_41" [label="clk_tick_gen"];
  "n_adgLpoAnAb905ZfSkwzA_43" [label="tick_counter"];
  "n_adgLpoAnAb905ZfSkwzA_45" [label="digit_splitter"];
  "n_adgLpoAnAb905ZfSkwzA_46" [label="clk_div_1khz"];
  "n_adgLpoAnAb905ZfSkwzA_49" [label="digit_sel[1:0]"];
  "n_adgLpoAnAb905ZfSkwzA_5" [label="clk"];
  "n_adgLpoAnAb905ZfSkwzA_50" [label="counter_4"];
  "n_adgLpoAnAb905ZfSkwzA_52" [label="mux_4x1"];
  "n_adgLpoAnAb905ZfSkwzA_54" [label="decoder_2x4"];
  "n_adgLpoAnAb905ZfSkwzA_56" [label="bcd"];
  "n_adgLpoAnAb905ZfSkwzA_58" [label="o_tick"];
  "n_adgLpoAnAb905ZfSkwzA_62" [label="o_tick_counter"];
  "n_adgLpoAnAb905ZfSkwzA_63" [label="clk, rst"];
  "n_adgLpoAnAb905ZfSkwzA_7" [label="rst"];
  "n_vGRKBN_a5CdBSBOYwats_11" [label="MODE\nmode=~mode"];
  "n_vGRKBN_a5CdBSBOYwats_12" [label="STARTrun_stop=0mode=0clear=0"];
  "n_vGRKBN_a5CdBSBOYwats_14" [label="Btn_L==1"];
  "n_vGRKBN_a5CdBSBOYwats_15" [label="Next Clock"];
  "n_vGRKBN_a5CdBSBOYwats_16" [label="Btn_R==1"];
  "n_vGRKBN_a5CdBSBOYwats_17" [label="Btn_R==1"];
  "n_vGRKBN_a5CdBSBOYwats_18" [label="Next Clock"];
  "n_vGRKBN_a5CdBSBOYwats_19" [label="Btn_D==1"];
  "n_vGRKBN_a5CdBSBOYwats_20" [label="push==1pop==0"];
  "n_vGRKBN_a5CdBSBOYwats_3" [label="STOP\nrun_stop=0clear=0"];
  "n_vGRKBN_a5CdBSBOYwats_5" [label="node_wats-5"];
  "n_vGRKBN_a5CdBSBOYwats_7" [label="CLEARclear=1"];
  "n_vGRKBN_a5CdBSBOYwats_9" [label="RUN\nrun_stop=1"];
  "n_adgLpoAnAb905ZfSkwzA_3" -> "n_adgLpoAnAb905ZfSkwzA_22";
  "n_adgLpoAnAb905ZfSkwzA_5" -> "n_adgLpoAnAb905ZfSkwzA_18";
  "n_adgLpoAnAb905ZfSkwzA_7" -> "n_adgLpoAnAb905ZfSkwzA_19";
  "n_adgLpoAnAb905ZfSkwzA_10" -> "n_adgLpoAnAb905ZfSkwzA_22";
  "n_adgLpoAnAb905ZfSkwzA_43" -> "n_adgLpoAnAb905ZfSkwzA_46";
  "n_adgLpoAnAb905ZfSkwzA_45" -> "n_adgLpoAnAb905ZfSkwzA_52";
  "n_adgLpoAnAb905ZfSkwzA_50" -> "n_adgLpoAnAb905ZfSkwzA_52";
  "n_adgLpoAnAb905ZfSkwzA_50" -> "n_adgLpoAnAb905ZfSkwzA_54";
  "n_adgLpoAnAb905ZfSkwzA_52" -> "n_adgLpoAnAb905ZfSkwzA_56";
  "n_adgLpoAnAb905ZfSkwzA_54" -> "n_adgLpoAnAb905ZfSkwzA_38";
  "n_adgLpoAnAb905ZfSkwzA_56" -> "n_adgLpoAnAb905ZfSkwzA_39";
  "n_adgLpoAnAb905ZfSkwzA_41" -> "n_adgLpoAnAb905ZfSkwzA_43";
  "n_adgLpoAnAb905ZfSkwzA_43" -> "n_adgLpoAnAb905ZfSkwzA_45";
  "n_vGRKBN_a5CdBSBOYwats_3" -> "n_vGRKBN_a5CdBSBOYwats_11";
  "n_vGRKBN_a5CdBSBOYwats_3" -> "n_vGRKBN_a5CdBSBOYwats_9";
  "n_vGRKBN_a5CdBSBOYwats_5" -> "n_vGRKBN_a5CdBSBOYwats_3";
  "n_vGRKBN_a5CdBSBOYwats_7" -> "n_vGRKBN_a5CdBSBOYwats_3";
  "n_vGRKBN_a5CdBSBOYwats_9" -> "n_vGRKBN_a5CdBSBOYwats_3";
  "n_vGRKBN_a5CdBSBOYwats_11" -> "n_vGRKBN_a5CdBSBOYwats_3";
}
